[
  {
    "number": 1,
    "emoji": "🗄️",
    "title": "O que é Banco de Dados?",
    "color": "blue",
    "description": "Banco de dados é um sistema especializado que permite armazenar, organizar e recuperar informações de maneira eficiente e segura. Ele é projetado para lidar com grandes volumes de dados, assegurando a integridade, consistência e disponibilidade das informações. Além disso, possibilita operações como inserção, consulta, atualização e exclusão (CRUD). Sistemas de banco de dados são essenciais para aplicações modernas, desde redes sociais até sistemas financeiros e de saúde, garantindo que os dados sejam facilmente acessíveis e protegidos contra falhas ou acessos indevidos."
  },
  {
    "number": 2,
    "emoji": "🔢",
    "title": "Tipos de Banco de Dados",
    "color": "green",
    "types": [
      {
        "name": "Relacional (SQL)",
        "description": "Os bancos de dados relacionais organizam informações em tabelas compostas por linhas (também chamadas de registros) e colunas (atributos ou campos). As tabelas podem se relacionar entre si, permitindo a modelagem de sistemas complexos. O SQL (Structured Query Language) é a linguagem padrão para manipulação desses dados, oferecendo comandos para consultar, inserir, atualizar e excluir registros. Esse modelo é ideal quando há necessidade de integridade e consistência elevadas, como em sistemas bancários ou ERPs.",
        "exemplos": ["MySQL", "PostgreSQL", "SQLite", "SQL Server"]
      },
      {
        "name": "Não Relacional (NoSQL)",
        "description": "Bancos de dados NoSQL foram desenvolvidos para atender às demandas de aplicações modernas que exigem escalabilidade, flexibilidade e desempenho. Eles não seguem o modelo relacional e podem armazenar dados de diferentes formas: documentos (JSON, BSON), chave-valor, colunas amplas ou grafos. São ideais para lidar com dados semi-estruturados ou não estruturados, como perfis de usuários, catálogos de produtos ou redes sociais, além de aplicações que precisam de alta disponibilidade e resposta rápida.",
        "exemplos": ["MongoDB", "Redis", "Cassandra", "Neo4j"]
      }
    ]
  },
  {
    "number": 3,
    "emoji": "📋",
    "title": "Conceitos Básicos",
    "color": "orange",
    "concepts": [
      {
        "term": "Tabela",
        "definition": "Estrutura fundamental dos bancos relacionais, onde os dados são organizados em linhas (registros) e colunas (atributos). Cada coluna define um tipo de dado, como texto, número ou data, e cada linha representa uma instância de entidade, como um cliente ou pedido."
      },
      {
        "term": "Documento",
        "definition": "Estrutura usada em bancos NoSQL baseados em documentos. É semelhante a um objeto JSON, onde os dados são armazenados em pares chave-valor. Permite a modelagem de informações complexas com flexibilidade, como listas aninhadas e objetos compostos."
      },
      {
        "term": "Chave Primária",
        "definition": "Campo que identifica de maneira única cada registro em uma tabela relacional. Evita a duplicação de registros e facilita a criação de relacionamentos entre tabelas através de chaves estrangeiras."
      },
      {
        "term": "Consulta (Query)",
        "definition": "Comando que permite buscar, inserir, atualizar ou excluir dados no banco. Pode ser simples, como selecionar todos os registros, ou complexa, envolvendo múltiplas tabelas e filtros específicos."
      }
    ]
  },
  {
    "number": 4,
    "emoji": "💾",
    "title": "Exemplo básico em SQL",
    "color": "purple",
    "example": "CREATE TABLE usuarios (\n  id INT PRIMARY KEY AUTO_INCREMENT,\n  nome VARCHAR(100) NOT NULL,\n  email VARCHAR(100) UNIQUE NOT NULL\n);\n\nINSERT INTO usuarios (nome, email) VALUES ('João', 'joao@email.com');\n\nSELECT * FROM usuarios;",
    "explanation": "O comando CREATE TABLE define uma nova tabela chamada 'usuarios' com três colunas: id, nome e email. O campo id é configurado como chave primária e auto-incrementa automaticamente a cada inserção. Os campos nome e email são obrigatórios (NOT NULL), sendo o email também único (UNIQUE). O comando INSERT adiciona um novo registro e o SELECT recupera todos os registros armazenados."
  },
  {
    "number": 5,
    "emoji": "📦",
    "title": "Exemplo básico em MongoDB",
    "color": "red",
    "example": "db.usuarios.insertOne({ nome: 'Maria', email: 'maria@email.com' });\n\ndb.usuarios.find({});",
    "explanation": "Em MongoDB, utilizamos coleções em vez de tabelas e documentos em vez de registros. O comando insertOne adiciona um novo documento à coleção 'usuarios', contendo as chaves nome e email. Já o comando find busca e retorna todos os documentos existentes na coleção. MongoDB permite esquemas flexíveis, aceitando documentos com diferentes estruturas na mesma coleção."
  },
  {
    "number": 6,
    "emoji": "🔐",
    "title": "Transações e Integridade",
    "color": "teal",
    "description": "Transações garantem que um conjunto de operações seja executado integralmente ou não seja executado, preservando a integridade dos dados. O conceito ACID resume as propriedades essenciais:\n- **Atomicidade**: todas as operações são concluídas ou nenhuma.\n- **Consistência**: o banco evolui apenas entre estados válidos.\n- **Isolamento**: operações concorrentes não interferem entre si.\n- **Durabilidade**: após a confirmação, os dados são preservados, mesmo em caso de falhas."
  },
  {
    "number": 7,
    "emoji": "⚡",
    "title": "Índices",
    "color": "yellow",
    "description": "Índices são estruturas criadas para melhorar a velocidade das consultas em bancos de dados. Funcionam como índices em livros, permitindo localizar rapidamente informações sem a necessidade de varrer todos os registros. Contudo, embora acelerem consultas, os índices consomem espaço adicional e podem impactar negativamente operações de inserção, atualização e deleção, já que essas exigem a atualização dos índices relacionados."
  },
  {
    "number": 8,
    "emoji": "🛠️",
    "title": "Ferramentas populares",
    "color": "cyan",
    "tools": [
      "phpMyAdmin: Interface web intuitiva para administrar bancos MySQL, permitindo consultas, backups e visualização de dados.",
      "MongoDB Compass: Ferramenta gráfica oficial para explorar, consultar e analisar bancos MongoDB, ideal para iniciantes e especialistas.",
      "pgAdmin: Completa interface gráfica para gestão do PostgreSQL, oferecendo recursos de modelagem, monitoramento e execução de scripts SQL.",
      "Redis CLI: Ferramenta de linha de comando para interação rápida e direta com o Redis, ideal para operações de chave-valor e cache.",
      "DBeaver: Plataforma universal para administração de múltiplos bancos de dados, com suporte a SQL e NoSQL em uma interface unificada."
    ]
  },
  {
    "number": 9,
    "emoji": "🌐",
    "title": "Como conectar em um banco de dados",
    "color": "gray",
    "description": "A conexão com bancos de dados é realizada por meio de bibliotecas específicas, denominadas drivers ou ORMs (Object-Relational Mappers). Essas ferramentas facilitam a execução de comandos, a manipulação de dados e o tratamento de erros de forma programática. Por exemplo:\n- **mysql2**: driver para conexão com MySQL em Node.js.\n- **mongoose**: ORM para interação com bancos MongoDB, oferecendo validação, modelagem e hooks.\n- **pg**: driver oficial para PostgreSQL, simples e eficiente. \nCada linguagem possui bibliotecas específicas para interagir com diferentes tipos de bancos de dados."
  },
  {
    "number": 10,
    "emoji": "📚",
    "title": "Recursos para aprender mais",
    "color": "gray",
    "resources": [
      "Documentação oficial de cada banco de dados, como MySQL (https://dev.mysql.com/doc/) e MongoDB (https://www.mongodb.com/docs/).",
      "Plataformas de cursos online como Udemy, Coursera, Alura e YouTube, que oferecem desde introduções até tópicos avançados.",
      "Livros clássicos como 'Database System Concepts' de Silberschatz, 'SQL For Dummies' para iniciantes e 'MongoDB: The Definitive Guide' para quem quer se aprofundar.",
      "Comunidades e fóruns como Stack Overflow, Reddit, e grupos especializados, ótimos para tirar dúvidas, compartilhar experiências e acompanhar as novidades da área."
    ]
  }
]
